The  VertexIndexPair  type exposes the following members.
 Properties
Name  |   Description
Bottom
 The index of the vertex pair from the bottom profile.
Top
 The index of the vertex pair from the top profile.
 See Also
  VertexIndexPair Class
  Autodesk.Revit.DB Namespace